app/controllers/images_controller.rb


    #   ]

      images = Site.find(params[:site_id]).images
---
SELECT  "sites".* FROM "sites" WHERE "sites"."id" = $1 LIMIT 1  [["id", 1]]
SELECT "images".* FROM "images" WHERE "images"."site_id" = $1  [["site_id", 1]]