app/controllers/sites_controller.rb

SELECT  "sites".* FROM "sites"  ORDER BY "sites"."id" ASC LIMIT 1
---
  def show
  	# byebug
  	respond_to do |format|

  	  format.js do
  	  	render :json => Site.first.data

SELECT  "sites".* FROM "sites"  ORDER BY "sites"."id" ASC LIMIT 1
UPDATE "sites" SET "data" = $1, "updated_at" = $2 WHERE "sites"."id" = $3
---
  def create
  	Site.create! if Site.first.nil?
   	s = Site.first
   	s.data = params["data"]
   	s.save